За отведенное время я разобрался с продвинутой асинхронной библиотекой для написания телеграм-ботов aiogram, также я разобрался с 
данных, в моем проекте сейчас используются 2 ключевые библиотеки - aigram и sqlite3. 
Теперь программа поддерживает регистрацию с помощью команды /start
Программа поддерживает заморозку аккаунта /freeze_account
Программа поддерживает удаление аккаунта /delete_account
Программа поддерживает создание нового продукта /put_product
Программа поддерживает доставку продукта /deliever_product
Программа поддерживает удаление продукта /delete_product
Также в консоль можно вывести всю информацию о продуктах - /test, об администраторах - /test_admins, о поставщиках - /test_suples,
о покупителях - /test_customs
В программе есть отдельная база данных для продуктов - products, для покупателей - customers, поставщиков - suppliers, 
администраторов - administrators.
Я не успел добавить в программу возможность создания новой базы данных для каждого поставщика и покупателя, также реализовать 
некоторые функции - эти исправления я внесу в ближайшее время
